In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randint(60,100,12).reshape(4,3),index = ['James','maria','brian','alice'], columns = ['kor','eng','math'])
df

       kor  eng  math
James   81   89    79
maria   80   65    66
brian   64   70    99
alice   99   89    69

In [3]:
df4 =pd.DataFrame(np.random.randint(60,100,16).reshape(4,4),index = ['James','maria','brian','alice'], columns = ['kor','eng','math','music'])

In [4]:
df4

       kor  eng  math  music
James   98   94    95     64
maria   84   60    60     86
brian   93   62    86     75
alice   98   98    85     73

In [5]:
df5 = df4.copy()
df5

       kor  eng  math  music
James   98   94    95     64
maria   84   60    60     86
brian   93   62    86     75
alice   98   98    85     73

In [6]:
df5.drop('math', axis =1, inplace = True)
df5

       kor  eng  music
James   98   94     64
maria   84   60     86
brian   93   62     75
alice   98   98     73

In [7]:
df6=df4.copy()

In [8]:
df6.drop(['eng','music'],axis=1, inplace=True)
df6

       kor  math
James   98    95
maria   84    60
brian   93    86
alice   98    85

In [9]:
#select row
#row index를 사용하여 행1개를 선택
mar1 = df4.loc['maria'] #location 
print(mar1)

kor      84
eng      60
math     60
music    86
Name: maria, dtype: int32

In [10]:
mar2 = df4.iloc[1] #intger location  문자 숫자 차이 
print(mar2)

kor      84
eng      60
math     60
music    86
Name: maria, dtype: int32

In [11]:
label = df4.loc[['brian','alice']]   #두개로 감싸줘야 한다.
label

       kor  eng  math  music
brian   93   62    86     75
alice   98   98    85     73

In [12]:
label2 = df4.iloc[[2,3]]     # 앞이 행 뒤가 열 인덱스 
label2

       kor  eng  math  music
brian   93   62    86     75
alice   98   98    85     73

In [13]:
# 슬라이싱은 [[A,B]]대신 [A:B] A부터 B번째까지 
#범위를 지정하여 행 선택
df4

       kor  eng  math  music
James   98   94    95     64
maria   84   60    60     86
brian   93   62    86     75
alice   98   98    85     73

In [14]:
label2 = df4.loc[['maria','brian']]
label2

       kor  eng  math  music
maria   84   60    60     86
brian   93   62    86     75

In [15]:
label3 = df4.loc['maria':'brian']
label3

       kor  eng  math  music
maria   84   60    60     86
brian   93   62    86     75

In [16]:
label4 = df4.iloc[[1,2]]
label4

       kor  eng  math  music
maria   84   60    60     86
brian   93   62    86     75

In [17]:
label5 = df4.iloc[1:3]
label5

       kor  eng  math  music
maria   84   60    60     86
brian   93   62    86     75

In [18]:
# select columns index 열 인덱스 
df4

       kor  eng  math  music
James   98   94    95     64
maria   84   60    60     86
brian   93   62    86     75
alice   98   98    85     73

In [19]:
label6 = df4['math']
print(label6)
print(type(label6))
## iloc는 행만 해당한다.

James    95
maria    60
brian    86
alice    85
Name: math, dtype: int32
<class 'pandas.core.series.Series'>

In [20]:
label7 = df4.eng     ##하나의 열을 가져올 때 점을 사용하여 가져옴
print(label7)
print(type(label7))

James    94
maria    60
brian    62
alice    98
Name: eng, dtype: int32
<class 'pandas.core.series.Series'>

In [21]:
# 두개 이상을 가져올 때는 list를 사용하여 가져온다. 
label8 = df4[['math','music']]
print(label8)
print(type(label8))

       math  music
James    95     64
maria    60     86
brian    86     75
alice    85     73
<class 'pandas.core.frame.DataFrame'>

In [22]:
# 한개를 가져오 되, data frame 형태로 가져오고 싶을 때 
label66 = df4[['math']]
print(label66)
print(type(label66))

       math
James    95
maria    60
brian    86
alice    85
<class 'pandas.core.frame.DataFrame'>

In [23]:
# select elements 
df4

       kor  eng  math  music
James   98   94    95     64
maria   84   60    60     86
brian   93   62    86     75
alice   98   98    85     73

In [24]:
label8 = df4.loc['maria','music']
label8

86

In [25]:
label9 = df4.loc['maria',['eng','math']]
label9

eng     60
math    60
Name: maria, dtype: int32

In [26]:
label88 = df4.iloc[1,3]
label88

86

In [27]:
label99 = df4.iloc[1,[1,2]]
label99

eng     60
math    60
Name: maria, dtype: int32

In [28]:
label10 = df4.loc['James',['eng','math','music']]
label10

eng      94
math     95
music    64
Name: James, dtype: int32

In [29]:
label11 = df4.loc[['maria','brian','alice'],['eng','math','music']]
label11

       eng  math  music
maria   60    60     86
brian   62    86     75
alice   98    85     73

In [30]:
label1010 = df4.iloc[0,[1,2,3]]
label1010

eng      94
math     95
music    64
Name: James, dtype: int32

In [31]:
label1111 = df4.iloc[[1,2,3],[1,2,3]]
label1111

       eng  math  music
maria   60    60     86
brian   62    86     75
alice   98    85     73

In [32]:
label111111 = df4.loc['maria':'alice','eng':'music'] ####
label111111

       eng  math  music
maria   60    60     86
brian   62    86     75
alice   98    85     73

In [33]:
label11111111 = df4.iloc[1:4,1:4]
label11111111

       eng  math  music
maria   60    60     86
brian   62    86     75
alice   98    85     73

In [34]:
#열추가 add columns 
df4

       kor  eng  math  music
James   98   94    95     64
maria   84   60    60     86
brian   93   62    86     75
alice   98   98    85     73

In [35]:
df4['gym']= [90,80,70,90]  #없으면 생성하고, 있으면 수정
df4

       kor  eng  math  music  gym
James   98   94    95     64   90
maria   84   60    60     86   80
brian   93   62    86     75   70
alice   98   98    85     73   90

In [36]:
df4.loc['gildong']= [90,70,60,75,60]
df4

         kor  eng  math  music  gym
James     98   94    95     64   90
maria     84   60    60     86   80
brian     93   62    86     75   70
alice     98   98    85     73   90
gildong   90   70    60     75   60

In [37]:
#set_indes
exam_data = {'이름':['길동','철수','영희'],
             '수학':[90,80,70],
             '영어':[98,89,95],
             '음악':[85,95,100],
             '체육':[100,90,90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  길동  90  98   85  100
1  철수  80  89   95   90
2  영희  70  95  100   90

In [38]:
df.set_index('이름',inplace=True)
print(df)

    수학  영어   음악   체육
이름
길동  90  98   85  100
철수  80  89   95   90
영희  70  95  100   90

In [39]:
#길동의 체육점수
df.iloc[0][3]

100

In [40]:
df.loc['길동','체육']

100

In [41]:
df.loc['길동']['체육']

100

In [42]:
#길동의 체육 점수를 변경하고 싶다면 
df.loc['길동','체육']= 90
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89   95  90
영희  70  95  100  90

In [43]:
df.loc['철수',['음악','체육']] = 50
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89   50  50
영희  70  95  100  90

In [44]:
df.loc['철수',['음악','체육']] = 100,50
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89  100  50
영희  70  95  100  90

In [45]:
df.iloc[1,[2,3]]=50
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89   50  50
영희  70  95  100  90

In [46]:
df.iloc[1,[2,3]] = 100,50
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89  100  50
영희  70  95  100  90

In [47]:
#전치
df.transpose()

이름  길동   철수   영희
수학  90   80   70
영어  98   89   95
음악  85  100  100
체육  90   50   90

In [48]:
#set index 추가 
exam_data = {'이름':['길동','철수','영희'],
             '수학':[90,80,70],
             '영어':[98,89,95],
             '음악':[85,95,100],
             '체육':[100,90,90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  길동  90  98   85  100
1  철수  80  89   95   90
2  영희  70  95  100   90

In [49]:
ndf2 = df.set_index('이름')
ndf2

    수학  영어   음악   체육
이름
길동  90  98   85  100
철수  80  89   95   90
영희  70  95  100   90

In [50]:
ndf2 = df.set_index('음악')
ndf2

     이름  수학  영어   체육
음악
85   길동  90  98  100
95   철수  80  89   90
100  영희  70  95   90

In [51]:
ndf3 = df.set_index(['음악','수학'])
ndf3

        이름  영어   체육
음악  수학
85  90  길동  98  100
95  80  철수  89   90
100 70  영희  95   90

In [52]:
#reindex
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index=['r0','r1','r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [53]:
# 인덱스를 새로 지정해서 
new_index = ['r0','r1','r2','r3','r4']     ### 없는 인덱스를 추가하면 값이 없어서 NaN로 생성된다. 
ndf = df.reindex(new_index)
print(ndf)

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [54]:
#reindex로 발생한 NaN을 0 값으로 변경
ndf2  = df.reindex(new_index,fill_value =0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [55]:
#reset_index #엑셀파일 여러번 저장시 계속 생기는 인덱스를 컬럼으로 인식 되지 않게
             #하기 위해 reset_index로 유지시키는 방법 
ndf2 = ndf2.reset_index()
ndf2

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15
3    r3   0   0   0   0   0
4    r4   0   0   0   0   0

In [56]:
#내림차순으로 행 인덱스 정렬  # 다양한 값을 기준으로 sort 할 수 있다. 
ndf2 = ndf2.sort_index(ascending=False)
print(ndf2)

  index  c0  c1  c2  c3  c4
4    r4   0   0   0   0   0
3    r3   0   0   0   0   0
2    r2   3   6   9  12  15
1    r1   2   5   8  11  14
0    r0   1   4   7  10  13

In [57]:
#열을 기준으로 내림차순으로 정렬하는 방법 
ndf3 = ndf2.sort_values(by='c1',ascending=False)
print(ndf3)

  index  c0  c1  c2  c3  c4
2    r2   3   6   9  12  15
1    r1   2   5   8  11  14
0    r0   1   4   7  10  13
4    r4   0   0   0   0   0
3    r3   0   0   0   0   0

In [58]:
#시리즈 
student1 = pd.Series({'국어':100,'영어':90,'수학':95})
student1

국어    100
영어     90
수학     95
dtype: int64

In [59]:
#과목별로 점수를 200으로 나누기
percentage = student1/200
print(percentage)
print(type(percentage))

국어    0.500
영어    0.450
수학    0.475
dtype: float64
<class 'pandas.core.series.Series'>

In [60]:
student1 = pd.Series({'국어':100,'영어':90,'수학':95})
student2 = pd.Series({'수학':90,'국어':80,'영어':80})

In [61]:
#순서가 달라 보이지만 덧셈이 가능하다. key값으로 value를 찾기 때문 
#두학생의 과목별 점수 사칙연산 가능
add1 = student1 + student2
add1

국어    180
수학    185
영어    170
dtype: int64

In [62]:
sub1 = student1 - student2
sub1

국어    20
수학     5
영어    10
dtype: int64

In [63]:
mul1 = student1*student2
mul1

국어    8000
수학    8550
영어    7200
dtype: int64

In [64]:
div1 = student1/student2
div1

국어    1.250000
수학    1.055556
영어    1.125000
dtype: float64

In [65]:
result = pd.DataFrame([add1,sub1,mul1,div1],index = ['덧셈','뺄셈','곱셈','나눗셈'])
print(result)

          국어           수학        영어
덧셈    180.00   185.000000   170.000
뺄셈     20.00     5.000000    10.000
곱셈   8000.00  8550.000000  7200.000
나눗셈     1.25     1.055556     1.125

In [66]:
#결측치가 있는경우 사칙연산
student1 = pd.Series({'국어':np.nan,'영어':90,'수학':95})
student2 = pd.Series({'수학':90,'국어':80,'영어':80})
add2 = student1 + student2
sub2 = student1 - student2
mul2 = student1*student2
div2 = student1/student2
result2 = pd.DataFrame([add2,sub2,mul2,div2],index = ['덧셈','뺄셈','곱셈','나눗셈'])
result2

     국어           수학        영어
덧셈  NaN   185.000000   170.000
뺄셈  NaN     5.000000    10.000
곱셈  NaN  8550.000000  7200.000
나눗셈 NaN     1.055556     1.125

In [67]:
#두학생의 과목별 점수 사칙연산(연산메소드 사용)
add3 = student1.add(student2, fill_value=0)
sub3 = student1.sub(student2, fill_value=0)
mul3 = student1.mul(student2, fill_value=0)
div3 = student1.div(student2, fill_value=0)
print(add3,sub3,mul3,div3)
result3 = pd.DataFrame([add3,sub3,mul3,div3],index = ['덧셈','뺄셈','곱셈','나눗셈'])
result3

국어     80.0
수학    185.0
영어    170.0
dtype: float64 국어   -80.0
수학     5.0
영어    10.0
dtype: float64 국어       0.0
수학    8550.0
영어    7200.0
dtype: float64 국어    0.000000
수학    1.055556
영어    1.125000
dtype: float64

       국어           수학        영어
덧셈   80.0   185.000000   170.000
뺄셈  -80.0     5.000000    10.000
곱셈    0.0  8550.000000  7200.000
나눗셈   0.0     1.055556     1.125

In [68]:
import seaborn as sns

In [71]:
titanic = sns.load_dataset('titanic')
print(titanic)
print(len(titanic))

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]
891

In [72]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [75]:
df = titanic.loc[:,['age','fare']]
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [76]:
df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [78]:
new_df = df+ 10
new_df

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]